import java.text.NumberFormat;
import java.util.HashMap;

public class HomeworkTest {
    public static void main(String[] args) {
        String data = "0$机械与动力工程学院}1$1}2$2}3$4}4$4}5$2}6$4}7$1}8$2}9$6}10$3}11$7|15|16}12$6}13$2|6|8\n" +
                "0$机械与动力工程学院}1$1}2$2}3$1}4$5}5$5}6$1}7$1}8$5}9$6}10$1}11$3|11|17}12$4}13$4|6|11\n" +
                "0$航空航天学院}1$1}2$1}3$3}4$3}5$3}6$5}7$1}8$4}9$5}10$2}11$6|12|17}12$5}13$5|6|10\n" +
                "0$机械与动力工程学院}1$1}2$1}3$2}4$3}5$6}6$2}7$2}8$5}9$4}10$4}11$1|4|7}12$5}13$1|10\n" +
                "0$生命科学技术学院}1$2}2$2}3$4}4$4}5$3}6$1}7$1}8$5}9$6}10$1}11$7|12|18}12$4}13$1|3|5\n" +
                "0$航空航天学院}1$1}2$1}3$4}4$4}5$2}6$4}7$1}8$5}9$6}10$1}11$5|7|17}12$6}13$5|6|8\n" +
                "0$航空航天学院}1$1}2$1}3$2}4$3}5$6}6$1}7$1}8$6}9$6}10$1}11$5|11|15}12$5}13$2|3|4\n" +
                "0$航空航天学院}1$2}2$1}3$4}4$4}5$3}6$2}7$1}8$5}9$6}10$3}11$4|12|13}12$5}13$4|6|8\n" +
                "0$人文学院}1$2}2$1}3$2}4$5}5$2}6$1}7$1}8$6}9$6}10$3}11$2|4|12}12$4}13$5|8|10\n" +
                "0$航空航天学院}1$1}2$1}3$1}4$3}5$5}6$2}7$1}8$6}9$6}10$4}11$1|4|5}12$6}13$2|3|4\n" +
                "0$电子信息与电气工程学院}1$1}2$1}3$2}4$2}5$6}6$1}7$1}8$4}9$4}10$8}11$3|12|13}12$4}13$8|9|12\n" +
                "0$航空航天学院}1$1}2$1}3$3}4$3}5$3}6$2}7$1}8$4}9$5}10$3}11$3|5}12$5}13$1|6|9\n" +
                "0$电子信息与电气工程学院}1$1}2$2}3$4}4$4}5$2}6$1}7$1}8$6}9$6}10$3}11$3|7|12}12$6}13$3|8|9\n" +
                "0$生物医学工程学院}1$2}2$2}3$5}4$4}5$2}6$2}7$1}8$4}9$4}10$3}11$14|18|19}12$6}13$8|10|11\n" +
                "0$电子信息与电气工程学院}1$1}2$1}3$4}4$4}5$4}6$2}7$1}8$4}9$5}10$3}11$4|7|14}12$5}13$8|9|11\n" +
                "0$电子信息与电气工程学院}1$1}2$1}3$4}4$4}5$3}6$1}7$1}8$3}9$6}10$3}11$1|12|19}12$3}13$8|9|12\n" +
                "0$生物医学工程学院}1$2}2$1}3$2}4$2}5$4}6$1}7$2}8$5}9$5}10$2}11$4|7|13}12$5}13$1|5|8\n" +
                "0$生命科学技术学院}1$2}2$1}3$2}4$5}5$5}6$5}7$1}8$4}9$5}10$1}11$7|12|17}12$6}13$4|5|6\n" +
                "0$机械与动力工程学院}1$2}2$1}3$3}4$3}5$4}6$2}7$1}8$4}9$4}10$1}11$7|15|16}12$6}13$1|4|10\n" +
                "0$机械与动力工程学院}1$2}2$2}3$2}4$2}5$4}6$1}7$1}8$5}9$5}10$2}11$5|12|13}12$3}13$1|8|10\n" +
                "0$航空航天学院}1$1}2$1}3$4}4$2}5$5}6$1}7$1}8$6}9$6}10$1}11$5|7|12}12$4}13$5|8|10\n" +
                "0$船舶海洋与建筑工程学院}1$1}2$1}3$2}4$3}5$5}6$1}7$1}8$5}9$6}10$2}11$3|17|19}12$3}13$4|5|9\n" +
                "0$物理与天文学院}1$2}2$1}3$3}4$3}5$5}6$2}7$1}8$4}9$5}10$3}11$12|16|20}12$4}13$4|8|11";


            // 定义一个HashMap，用于存储学院和国外留学毕业意向的学生数量
            HashMap<String, Integer> collegeMap = new HashMap<>();
            // 定义一个HashMap，用于存储学院和总学生数量
            HashMap<String, Integer> totalMap = new HashMap<>();
           //切割为单条数据
            String[] a = data.split("\n");
            // 遍历数据
            for (String str : a) {
                // 将数据按照"}"切割
                String[] parts = str.split("\\}");
                // 定义一个字符串，存储学院名称
                String collegeName = "";
                // 定义一个整型变量，用于存储毕业去向的数字
                int code = 0;
                // 遍历每条数据的每个部分
                for (String part : parts) {
                    // 将每个部分按照“$”分割
                    String[] items = part.split("\\$");
                    // 如果部分以“0$”开头，则表示该部分是学院名称
                    if (items[0].equals("0")) {
                        collegeName = items[1];
                    }
                    // 如果部分以“10$”开头，则表示该部分是毕业去向代码
                    if (items[0].equals("10")) {
                        code = Integer.parseInt(items[1]);
                    }
                }
                // 如果code为2，则表示该学生‘国外留学
                if (code == 2) {
                    // 如果collegeMap中存在该学院，则将该学院的国外留学毕业意向的学生数量加1
                    if (collegeMap.containsKey(collegeName)) {
                        collegeMap.put(collegeName, collegeMap.get(collegeName) + 1);
                    } else {
                        // 如果collegeMap中不存在该学院，则将该学院的国外留学毕业意向的学生数量设置为1
                        collegeMap.put(collegeName, 1);
                    }
                }
                // 如果totalMap中存在该学院，则将该学院的总学生数量加1
                if (totalMap.containsKey(collegeName)) {
                    totalMap.put(collegeName, totalMap.get(collegeName) + 1);
                } else {
                    // 如果totalMap中不存在该学院，则将该学院的总学生数量设置为1
                    totalMap.put(collegeName, 1);
                }
            }
            // 定义一个变量，用于存储最高占比的学院
            String maxCollege = "";
            // 定义一个变量，用于存储最高占比
            double maxRate = 0;
            // 遍历collegeMap
            for (String collegeName : collegeMap.keySet()) {
                // 计算该学院的国外留学毕业意向的学生占比
                double rate = (double) collegeMap.get(collegeName) / totalMap.get(collegeName);
                // 创建一个数值格式化对象
                NumberFormat numberFormat = NumberFormat.getInstance();
                numberFormat.setMaximumFractionDigits(2);
                String result = numberFormat.format(rate*100);
                System.out.println(collegeName+"="+result+"%");
                // 如果该学院的占比大于最高占比，则更新最高占比和最高占比的学院
                if (rate > maxRate) {
                    maxRate = rate;
                    maxCollege = collegeName;
                }
            }
            // 输出最高占比的学院
            System.out.println("最高占比的学院是：" + maxCollege);
        }
        }


